Dummy_ClientWsSOAP/src/main/resources/application.properties


spring.application.name=Dummy_ClientWsSOAP

logging.config=classpath:logback.xml
logging.level.root=INFO

server.port=8082

#CONFIG 'BANNER':
banner.location=banner/bannerWS.txt
      
ws.timer.component=timer://timer1?period=20s

ws.soap.request=<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:tem="http://tempuri.org/"> <soapenv:Header/> <soapenv:Body> <tem:Multiply> <tem:intA>10</tem:intA> <tem:intB>5</tem:intB> </tem:Multiply> </soapenv:Body> </soapenv:Envelope>

